In [1]:
import pandas as pd
import numpy as np

In [2]:
names = ["John","Shawn","Tom","Matt","John","Steve","Smith","Ricky","Adam"]
pd.Series(names)

0     John
1    Shawn
2      Tom
3     Matt
4     John
5    Steve
6    Smith
7    Ricky
8     Adam
dtype: object

In [3]:
x = np.random.randint(1,10,(5,5))

In [4]:
# pd.Series(x)

In [5]:
dept = ["IT","IT","HR","HR","IT","SALES","IT","SALES","HR"]
data = {
    "names" : names,
    "dept" : dept
}

In [6]:
pd.Series(data)

names    [John, Shawn, Tom, Matt, John, Steve, Smith, R...
dept            [IT, IT, HR, HR, IT, SALES, IT, SALES, HR]
dtype: object

In [7]:
pd.DataFrame(data)

   names   dept
0   John     IT
1  Shawn     IT
2    Tom     HR
3   Matt     HR
4   John     IT
5  Steve  SALES
6  Smith     IT
7  Ricky  SALES
8   Adam     HR

In [8]:
df = pd.DataFrame(data)

In [9]:
df['names']

0     John
1    Shawn
2      Tom
3     Matt
4     John
5    Steve
6    Smith
7    Ricky
8     Adam
Name: names, dtype: object

In [10]:
series = pd.Series(names)

In [11]:
series

0     John
1    Shawn
2      Tom
3     Matt
4     John
5    Steve
6    Smith
7    Ricky
8     Adam
dtype: object

In [12]:
series[0]

'John'

In [13]:
series[1]

'Shawn'

In [14]:
series = pd.Series(names, index=['a','b','c','d','e','f','g','h','i'])

In [15]:
series

a     John
b    Shawn
c      Tom
d     Matt
e     John
f    Steve
g    Smith
h    Ricky
i     Adam
dtype: object

In [16]:
series[0]

'John'

In [17]:
series[0:4]

a     John
b    Shawn
c      Tom
d     Matt
dtype: object

In [18]:
df = pd.DataFrame(data, index=['a','b','c','d','e','f','g','h','i'])

In [19]:
df

   names   dept
a   John     IT
b  Shawn     IT
c    Tom     HR
d   Matt     HR
e   John     IT
f  Steve  SALES
g  Smith     IT
h  Ricky  SALES
i   Adam     HR

In [20]:
# Indexing is not allowed in data frames
# df[0]

In [21]:
df[0:4]

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR
d   Matt   HR

In [22]:
df.columns

Index(['names', 'dept'], dtype='object')

In [23]:
# df['names']
# df['dept']

In [24]:
df['names'][0]

'John'

In [25]:
df.iloc

In [26]:
df.iloc[0]

names    John
dept       IT
Name: a, dtype: object

In [27]:
df.iloc[0:3]

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR

In [28]:
# return first 5 rows
df.head()

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR
d   Matt   HR
e   John   IT

In [29]:
df.head(3)

   names dept
a   John   IT
b  Shawn   IT
c    Tom   HR

In [30]:
# will return last 5 rows
df.tail()

   names   dept
e   John     IT
f  Steve  SALES
g  Smith     IT
h  Ricky  SALES
i   Adam     HR

In [32]:
df.iloc[0]

names    John
dept       IT
Name: a, dtype: object

In [34]:
df.loc['a']

names    John
dept       IT
Name: a, dtype: object

In [35]:
df = pd.DataFrame(data)

In [36]:
df.iloc[0]

names    John
dept       IT
Name: 0, dtype: object

In [37]:
df.loc[0]

names    John
dept       IT
Name: 0, dtype: object

In [38]:
df.iloc[0:3]

   names dept
0   John   IT
1  Shawn   IT
2    Tom   HR

In [39]:
df.loc[0:3]

   names dept
0   John   IT
1  Shawn   IT
2    Tom   HR
3   Matt   HR

In [40]:
df.head()

   names dept
0   John   IT
1  Shawn   IT
2    Tom   HR
3   Matt   HR
4   John   IT

In [41]:
df.shape

(9, 2)

In [42]:
df['salary'] = np.random.randint(25000,100000,9)

In [43]:
df.head()

   names dept  salary
0   John   IT   46346
1  Shawn   IT   99451
2    Tom   HR   89084
3   Matt   HR   31639
4   John   IT   72154

In [44]:
df['incentive'] = np.random.randint(5000,20000,9)

In [45]:
df.head()

   names dept  salary  incentive
0   John   IT   46346       8205
1  Shawn   IT   99451      17741
2    Tom   HR   89084      19902
3   Matt   HR   31639      17741
4   John   IT   72154      12480

In [46]:
df['net_salary'] = df['salary'] + df['incentive']

In [47]:
df.head()

   names dept  salary  incentive  net_salary
0   John   IT   46346       8205       54551
1  Shawn   IT   99451      17741      117192
2    Tom   HR   89084      19902      108986
3   Matt   HR   31639      17741       49380
4   John   IT   72154      12480       84634

In [48]:
df['dept'] == 'IT'

0     True
1     True
2    False
3    False
4     True
5    False
6     True
7    False
8    False
Name: dept, dtype: bool

In [51]:
df[df['dept'] == 'IT']

   names dept  salary  incentive  net_salary
0   John   IT   46346       8205       54551
1  Shawn   IT   99451      17741      117192
4   John   IT   72154      12480       84634
6  Smith   IT   63038      19787       82825

In [52]:
df[df['dept'] == 'IT']['names']

0     John
1    Shawn
4     John
6    Smith
Name: names, dtype: object

In [55]:
df[df['dept'] == 'IT'][['names','salary','incentive']]

   names  salary  incentive
0   John   46346       8205
1  Shawn   99451      17741
4   John   72154      12480
6  Smith   63038      19787

In [56]:
df[(df['dept'] == 'IT') & (df['salary'] > 50000)]

   names dept  salary  incentive  net_salary
1  Shawn   IT   99451      17741      117192
4   John   IT   72154      12480       84634
6  Smith   IT   63038      19787       82825

In [57]:
df[(df['dept'] == 'IT') & (df['salary'] > 50000)].reset_index()

   index  names dept  salary  incentive  net_salary
0      1  Shawn   IT   99451      17741      117192
1      4   John   IT   72154      12480       84634
2      6  Smith   IT   63038      19787       82825

In [58]:
df[(df['dept'] == 'IT') & (df['salary'] > 50000)].reset_index(drop=True)

   names dept  salary  incentive  net_salary
0  Shawn   IT   99451      17741      117192
1   John   IT   72154      12480       84634
2  Smith   IT   63038      19787       82825

In [59]:
df.describe()

             salary     incentive     net_salary
count      9.000000      9.000000       9.000000
mean   63787.111111  15024.000000   78811.111111
std    27328.787439   3982.520088   28638.556085
min    29778.000000   8205.000000   42561.000000
25%    44978.000000  12480.000000   54551.000000
50%    63038.000000  14189.000000   82825.000000
75%    89084.000000  17741.000000  108986.000000
max    99451.000000  19902.000000  117192.000000

In [61]:
df[['salary','incentive','net_salary']].sum()

salary        574084
incentive     135216
net_salary    709300
dtype: int64

In [62]:
df[['salary','incentive','net_salary']].mean()

salary        63787.111111
incentive     15024.000000
net_salary    78811.111111
dtype: float64

In [63]:
df[['salary','incentive','net_salary']].min()

salary        29778
incentive      8205
net_salary    42561
dtype: int32

In [64]:
df[['salary','incentive','net_salary']].max()

salary         99451
incentive      19902
net_salary    117192
dtype: int32

In [65]:
df['dept'].value_counts()

IT       4
HR       3
SALES    2
Name: dept, dtype: int64

In [66]:
df['dept'].unique()

array(['IT', 'HR', 'SALES'], dtype=object)